"""
Основы ООП(Объектно Ориентированное Программирование):
    Наследование 
    Полиморфизм - это единый интерфейс для операция над разными типами данных
        +
        2 + 2 = 4
        '2' + '2' = '22'
        [2,3] + [4,5] = [2,3,4,5]
        len("fgd")
    Инкапсуляция - способность изолировать
    Абстракция (просто знать название)

у классов могут существовать свои переменные
переменные класса - это аргументы
функции класса - это методы

Функциональное пограммирование

"""
def person():
    pass

p = person()
p_2 = person()

class Person:
    pass
# инициализировать класс - создать/вызвать
# и создать экземпляр класса
person = Person()